{
 "feed_url": "/blog/feed.json",
 "home_page_url": "/",
 "items": [
  {
   "author": {
    "name": "xriss"
   },
   "content_html": "<a href=\"/blog/2017-03-19-chatdown\" class=\"blog_post_link\">\n\t<span class=\"blog_post_title\">Chatdown</span>\n\t<span class=\"blog_post_snip\"><p>Chatdown is  a markdown like text format for describing chat trees, the \nidea is to have all the logic somewhere else and just use this for \ndescribing the relationship and hierarchy of the text.</p>\n<p>The bad news is this means you have to label each part of the chat with \nreasonable ids so the code can find it. Naming things is hard and has\nto be done.</p>\n<p>Mostly the file is interpreted as paragraphs similar to markdowns \nparagraphs separated by empty lines, between these paragraphs lines \nbeginning with one of the special characters #&lt;&gt;= switch the mode, and \nassign where the next set of paragraphs will be stored.</p>\n<p>Following immediately on from these special characters with no white \nspace in between are the id labels, these are used to name each set of \nparagraphs and allow references between them. This is the most complex \npart of the chatdown format.</p>\n<p>A chat is started by beginning a line with a # this can be thought of \nas the talky part of an NPCs brain and a chatdown file contains \nmultiple chats. These chats can reference each other, for example one \nNPC can check what you have told another NPC.</p>\n<p>The first paragraph of a #chat is the display name of the NPC, the rest \nof the paragraphs are a longer description. More data can also be \nassociated with the NPC here but I will go into that another time.</p>\n<p>Responses are started with a &lt; and they belong to the current chat, \nthese are the things that an NPC says, for instance, &lt;welcome is the \nfirst thing an NPC says when you talk to them.</p>\n<p>Decisions are your choices that can be made after an NPC talks, started \nwith a &gt; these are stored in the current response and are primarily \nlinks to another response.</p>\n<p>With decisions the first paragraph is displayed and the remaining \nparagraphs can be used as the spoken out loud dialogue. Some styles of \ndialogue writing use this form, others only need the first paragraph.</p>\n<p>Proxies are variables associated with this chat, they are assigned by \nlines beginning with an = and all paragraphs following are given to \nthis proxy. Proxies way be set inside any of the other states and the \nchange will happen as you progress through the chat. This allows us to \ntrack decisions by changing a proxy inside the decision.</p>\n<p>Proxies may be expanded inside paragraphs or even option names by using \nsquiggly brackets like so {proxyname}, more complicated expansions will \nbe added later if needed.</p>\n<p>This is just an overview and its best we explain with some code, so \ntake a look at the following chatdown example which you will find \nembedded at the top of this fun64 file. The code to parse and display \nthis format is included, probably best you do not look too closely at \nthat bit :)</p>\n<p>Since chatdown took some time to formalise, it is also going to take \nmore than one short post to explain, expect a follow up with a more \ncomplex example.</p>\n</span>\n\t<span class=\"blog_post_user\">\n\t\t<span>~ xriss</span>\n\t\t<span><i>2017-03-19</i></span>\n\t</span>\n</a>\n\n",
   "date_published": "2017-03-19T00:00:00.000Z",
   "id": "/blog/2017-03-19-chatdown",
   "title": "Chatdown",
   "url": "/blog/2017-03-19-chatdown"
  },
  {
   "author": {
    "name": "xriss"
   },
   "content_html": "<a href=\"/blog/2017-02-12-hello-world\" class=\"blog_post_link\">\n\t<span class=\"blog_post_title\">Hello World!</span>\n\t<span class=\"blog_post_snip\"><p>Apparently if your hello world example is longer than a couple of lines \nthen you are open to ridicule.</p>\n<p>I suspect people who say this are blissfully unaware exactly what _main \ngets up to before your code runs and lets not even think about C++.</p>\n<p>Still it helps to remove as much gubbins as possible so the code that&#39;s \nrunning becomes obvious. Fun64 is built around the idea that you should \ndefine the hardware before the program runs so lets hide all that away \ninside a builtin function that will set you up a basic looking screen \nto work with.</p>\n<p>Introducing the configurator, this function will provide various setups \ndepending on the mode requested and also provide a main function that \nwill allow you to provide a single update function rather than dealing \nwith more complexities. A single update function is less optimal but a \nperfectly reasonable way to write short bits of test code.</p>\n<p>So far the only mode we have is &quot;fun64&quot; which will get you a 60fps \n320x240 screen with three layers and the Swanky32 palette. The three \nlayers gives us a copper background, a tile+sprite foreground and \nfinally a text overlay on the very top. For graphical memory we have a \n64x64 area of 8x8 tiles (4096 in total) and we auto upload the 4x8 \nfun64 font to the very first line for use by the text layer.</p>\n<p>NB: If you clobber this top line all your text will go funny, just like \non real hardware.</p>\n<p>The main point of the layers is so we can have drop shadows between \nthem, the text layer on top gives us some very cheap 80s looking text \nmenus when used with solid blocks of background color.</p>\n</span>\n\t<span class=\"blog_post_user\">\n\t\t<span>~ xriss</span>\n\t\t<span><i>2017-02-12</i></span>\n\t</span>\n</a>\n\n",
   "date_published": "2017-02-12T00:00:00.000Z",
   "id": "/blog/2017-02-12-hello-world",
   "title": "Hello World!",
   "url": "/blog/2017-02-12-hello-world"
  },
  {
   "author": {
    "name": "xriss"
   },
   "content_html": "<a href=\"/blog/2017-01-27-comic-test\" class=\"blog_post_link\">\n\t<span class=\"blog_post_title\">Comic test.</span>\n\t<span class=\"blog_post_snip\"><p>Lets see if we can build 4lfa.com style comics using just fun64 :)</p>\n</span>\n\t<span class=\"blog_post_user\">\n\t\t<span>~ xriss</span>\n\t\t<span><i>2017-01-27</i></span>\n\t</span>\n</a>\n\n",
   "date_published": "2017-01-27T00:00:00.000Z",
   "id": "/blog/2017-01-27-comic-test",
   "title": "Comic test.",
   "url": "/blog/2017-01-27-comic-test"
  },
  {
   "author": {
    "name": "xriss"
   },
   "content_html": "<a href=\"/blog/2017-01-20-basic-fun\" class=\"blog_post_link\">\n\t<span class=\"blog_post_title\">Basic fun!</span>\n\t<span class=\"blog_post_snip\"><p>A cut down and basic fun example, we do not make many assumptions so \nyou are free to configure and setup your code to your own tastes.</p>\n<p>There are only two parts that you must provide for fun to work. The \nfirst is a table describing the virtual hardware component setup, eg \nthe resolution of screen and tilemaps and sprite layers to display.</p>\n<pre><code>hardware={\n    {\n        component=&quot;screen&quot;,\n        size={424,240}, -- lowrez with a 1920x1080 aspect\n        scale=3, -- draw in a window at 3 times scale\n        fps=60, -- 60 fps please\n    },\n    ...\n}</code></pre><p>This requests the virtual hardware that will be setup before main is \ncalled. system is a global table that will be created according to your \nrequested hardware and can then be referenced when the main function is \ncalled.</p>\n<p>The second is a main function which will be called as a yield-able \nco-routine with a table that should be treated as an incoming message. \nUse the basic skeleton below to receive need.setup/update/draw \nrequests. As you can see it is possible to have multiple needs at once \nand this call structure allows for a setup, repeat update/draw then cleanup \nflow of code within this co-routine.</p>\n<pre><code>function main(need)\n    if not need.setup then need=coroutine.yield() end -- wait for setup request\n\n    -- perform setup\n\n    local done=false while not done do\n        need=coroutine.yield()\n\n        if need.update then\n\n            -- perform update\n\n        end\n\n        if need.draw then\n\n            -- perform draw\n\n        end            \n\n        if need.clean then done=true end -- cleanup requested\n    end\n\n    -- perform cleanup\n\nend</code></pre></span>\n\t<span class=\"blog_post_user\">\n\t\t<span>~ xriss</span>\n\t\t<span><i>2017-01-20</i></span>\n\t</span>\n</a>\n\n",
   "date_published": "2017-01-20T00:00:00.000Z",
   "id": "/blog/2017-01-20-basic-fun",
   "title": "Basic fun!",
   "url": "/blog/2017-01-20-basic-fun"
  }
 ],
 "title": "Title",
 "version": "https://jsonfeed.org/version/1"
}